[
  {
    "pun": "Q: How many programmers does it take to change a light bulb?",
    "punchline": "A: None. It's a hardware problem."
  },
  {
    "pun": "Q: What does a proud computer call its little son?",
    "punchline": "A: A microchip off the old block."
  },
  {
    "pun": "Q: What is another name for a computer virus?",
    "punchline": "A: A terminal illness"
  },
  {
    "pun": "Q: Why did the computer spy quit?",
    "punchline": "A: They couldn’t hack it anymore!"
  },
  {
    "pun": "Q: What did the motherboard say to the new software?",
    "punchline": "A: I’ll show you who’s Dos!"
  },
  {
    "pun": "Q: What does a floppy disk do when it needs a break?",
    "punchline": "A: It goes for a C: drive!"
  },
  {
    "pun": "Q: Why was the computer geek disappointed by the zoo?",
    "punchline": "A: They couldn’t find any RAM!"
  },
  {
    "pun": "Q: Which way did the computer programmer go?",
    "punchline": "A: They went data way!"
  },
  {
    "pun": "Q: What do you get when you cross a computer with a hamburger?",
    "punchline": "A: A Big Mac!"
  },
  {
    "pun": "Q: How do you find a spider on the internet?",
    "punchline": "A: Check out its web site!"
  },
  {
    "pun": "Q: How did the computer catch a cold?",
    "punchline": "A: Someone opened too many Windows!"
  },
  {
    "pun": "Q: Why don’t Vikings like to send emails?",
    "punchline": "A: They prefer to use Norse code!"
  },
  {
    "pun": "Q: What do you say when a JavaScript interview went bad?",
    "punchline": "A: Don’t call us, we'll callback you. We promise!"
  },
  {
    "pun": "Q: Why did the computer programmer drown?",
    "punchline": "A: They couldn't figure out whether to float left or right!"
  },
  {
    "pun": "Q: How do you comfort a JavaScript bug?",
    "punchline": "A: You console it!"
  },
  {
    "pun": "Q: Why did the programmer quit their job?",
    "punchline": "A: Because they didn't get arrays!"
  },
  {
    "pun": "Q: What do computers and air conditioners have in common?",
    "punchline": "A: They both become useless when you open Windows!"
  },
  {
    "pun": "Q: Why do Java programmers wear glasses?",
    "punchline": "A: They cannot C#!"
  },
  {
     "pun": "Q: Do you know the band 1023 megabytes?",
     "punchline": "A: They haven’t had a gig yet!"
  },
  {
    "pun": "Q: Why did the JavaScript developer lose their job?",
    "punchline": "A: They couldn't keep their Promises!"
  }
]
